{
    "id":"blood_type_cheat_sheet",
    "name":"Blood Type",
    "description": "Human blood is grouped into four types: A, B, AB, and O. Each letter refers to a kind of antigen, or protein, on the surface of red blood cells. For example, the surface of red blood cells in Type A blood has antigens known as A-antigens. Each blood type is also grouped by its Rhesus factor, or Rh factor. Blood is either Rh positive (Rh+) or Rh negative (Rh-). Rhesus refers to another type of antigen, or protein, on the surface of red blood cells.",
    "metadata":{
        "sourceName":"Wikipedia",
        "sourceUrl":"https://en.wikipedia.org/wiki/Blood_type"
    },
    "template_type": "reference",
    "section_order":[
        "ABO blood group system",
        "Rh blood group system"
    ],
    "aliases": [
    "blood types",
    "blood",
    "blood group",
    "abo blood group system",
    "abo blood group",
    "rh blood group system",
    "rh blood group"
  ],
    "sections":{
        "ABO blood group system":[
            {
                "key":"Group A",
                "val":"Has only the A antigen on red cells (and B antibody in the plasma). Group A can donate red blood cells to Group A and Group AB."
            },
            {
                "key":"Group B",
                "val":"Has only the B antigen on red cells (and A antibody in the plasma). Group B can donate red blood cells to Group B and Group AB."
            },
            {
                "key":"Group AB",
                "val":"Has both A and B antigens on red cells (but neither A nor B antibody in the plasma). Group AB can only donate to Group AB, but can receive from all others, it is the universal recipient."
            },
            {
                "key":"Group 0",
                "val":"Has neither A nor B antigens on red cells (but both A and B antibody are in the plasma). Group 0 can donate red blood cells to anybody, it is the universal donor."
            },
            {
                "key":"**Blood Transfusion-Red blood cell compatibility**",
                "val":"The Rhesus factor has a significant roll in blood transfusion that is not examined in this Cheat Sheet, for more information check the link below. This Cheat Sheet is, of course, not to be taken as a strict medical guide."
            }
            
        ],
        "Rh blood group system":[
            {
                "key":"Rh positive/Rh+",
                "val":"The antigen called the Rh factor is present (+)."
            },
            {
                "key":" Rh negative/Rh-",
                "val":"The antigen called the Rh factor is absent (–)."
            }  
        ]
      
    }
}
