{
    "id": "chess_cheat_sheet",
    "name": "Chess",
    "description": "Strategy Board Game",
    "metadata": {
        "sourceName": "Wikipedia",
        "sourceUrl": "https://en.wikipedia.org/wiki/Chess"
    },
    "aliases": [
        "chess pieces",
        "chess gameplay",
        "chess movement"
    ],
    "template_type": "reference",
    "section_order": [
        "Pieces",
        "Gameplay",
        "Special Movement"
    ],
    "sections": {
        "Pieces": [
            {
                "key": "♙ Pawn",
                "val": "Moves forward one or two spaces in its first move; moves one space forward at a time thereafter. Captures pieces 1 square forward diagonally"
            },
            {
                "key": "♘ Knight",
                "val": "Moves and captures in an L shape: two spaces in any direction and one space out at a 90 degree angle. Can jump over other pieces"
            },
            {
                "key": "♗ Bishop",
                "val": "Moves and captures diagonally as far as it would like in an unobstructed single direction"
            },
            {
                "key": "♖ Rook",
                "val": "Moves and captures along non-diagonal straight lines as far as it would like in an unobstructed single direction"
            },
            {
                "key": "♕ Queen",
                "val": "Moves and captures along any straight lines (diagonal or non-diagonal) as far as it would like in an unobstructed single direction. A combination of a bishop and a rook"
            },
            {
                "key": "♔ King",
                "val": "Moves and captures one space in any direction, as long as it won't be in \"check\" in the new square"
            }
        ],
        "Gameplay": [
            {
                "key": "Basic play",
                "val": "The player using the white pieces goes first; players then alternate turns until the end of the game"
            },
            {
                "key": "Check",
                "val": "When a king is under immediate attack by an enemy piece, it is in \"check.\" The player must move so that the king is out of check. If they cannot, it is checkmate"
            },
            {
                "key": "Checkmate",
                "val": "If a player's king is under immediate attack (in check) by an enemy's piece and the player cannot get their king out of check (by moving the king, capturing the attacking piece, or blocking the attack), they are checkmated and have lost"
            },
            {
                "key": "Stalemate",
                "val": "If a player's king is not under immediate attack but the player has no other legal moves, it is a stalemate and the game is a draw"
            },
            {
                "key": "Threefold repetition",
                "val": "If the same position is repeated three times (does not have to be in succession), either player can claim a draw"
            }
        ],
        "Special Movement": [
            {
                "key": "Castling",
                "val": "If a king and one of its rooks haven't moved yet in the game and there are no pieces between them, they can \"castle.\" With either the king-side or the queen-side rook, the king moves two squares towards the rook and the rook moves to the other side of the king, right next to it. A player cannot castle if the king is in check or would pass through (or into) spaces that are under attack"
            },
            {
                "key": "En passant",
                "val": "Immediately after a pawn moves two squares forward with its first move, an enemy pawn that could have captured it if the pawn had moved one square is able to do so as if the pawn had only moved forward one square"
            },
            {
                "key": "Promotion",
                "val": "If a pawn reaches the last row on the board, it can be promoted to be any other piece that the player desires"
            }
        ]
    }
}
