{
    "id": "geany_cheat_sheet",
    "name": "Geany",
    "description": "Lightweight code editor",
    "metadata": {
        "sourceName": "Geany Wiki",
        "sourceUrl": "http://wiki.geany.org/howtos/sorted_keyboard_shortcuts"
    },
    "aliases": [
        "geany editor"
    ],
    "template_type": "keyboard",
    "section_order": [
        "Moving around in the document",
        "Moving the document",
        "Finding text, selecting text",
        "Cut and paste",
        "Editing",
        "Files",
        "Build, make and compile",
        "Other"
    ],
    "sections": {
        "Moving around in the document": [{
            "val": "Go to Start of Line: Move the caret to the start of the line. Behaves differently if smart_home_key is set.",
            "key": "Home"
        }, {
            "val": "Go to End of Line: Move the caret to the end of the line.",
            "key": "End"
        }, {
            "val": "Go to Start of Display Line: Move the caret to the start of the display line. This is useful when you use line wrapping and want to jump to the start of the wrapped, virtual line, not the real start of the whole line. If the line is not wrapped, it behaves like Go to Start of Line.",
            "key": "[Alt] [Home]"
        }, {
            "val": "Go to End of Display Line: Move the caret to the end of the display line. If the line is not wrapped, it behaves like Go to End of Line.",
            "key": "[Alt] [End]"
        }, {
            "val": "Scroll up by one line: Scrolls the view.",
            "key": "[Alt] [Up]"
        }, {
            "val": "Scroll down by one line: Scrolls the view.",
            "key": "[Alt] [Down]"
        }, {
            "val": "Scroll to current line: Scrolls the current line into the centre of the view. The cursor position and or an existing selection will not be changed.",
            "key": "[Ctrl] [Shift] [L]"
        }, {
            "val": "Go to line: Focuses the Go to Line entry (if visible) or shows the Go to line dialog.",
            "key": "[Ctrl] [L]"
        }, {
            "val": "Go to matching brace: If the cursor is ahead or behind a brace, then it is moved to the brace which belongs to the current one. If this keyboard shortcut is pressed again, the cursor is moved back to the first brace.",
            "key": "[Ctrl] [B]"
        }, {
            "val": "Toggle marker: Set a marker on the current line, or clear the marker if there already is one.",
            "key": "[Ctrl] [M]"
        }, {
            "val": "Go to previous marker: Go to the previous marker in the current document.",
            "key": "[Ctrl] [,]"
        }, {
            "val": "Go to next marker: Go to the next marker in the current document.",
            "key": "[Ctrl] [.]"
        }, {
            "val": "Go to Previous Word Part: Go to the previous part of the current word.",
            "key": "[Ctrl] [/]"
        }, {
            "val": "Go to Next Word Part: Go to the next part of the current word.",
            "key": "[Ctrl] [\\\\]"
        }, {
            "val": "Navigate forward a location: Switches to the next location in the navigation history. See the section called Code Navigation History.",
            "key": "[Alt] [Right]"
        }, {
            "val": "Navigate back a location: Switches to the previous location in the navigation history. See the section called Code navigation history.",
            "key": "[Alt] [Left]"
        }],
        "Moving the document": [{
            "val": "Move document right: Changes the current document with the right hand one.",
            "key": "[Ctrl] [Shift] [PageDown]"
        }, {
            "val": "Move document left: Changes the current document with the left hand one.",
            "key": "[Ctrl] [Shift] [PageUp]"
        }, {
            "val": "Switch to right document: Switches to the next open document.",
            "key": "[Ctrl] [PageDown]"
        }, {
            "val": "Switch to left document: Switches to the previous open document.",
            "key": "[Ctrl] [PageUp]"
        }, {
            "val": "Zoom In: Zooms in the text.",
            "key": "[Ctrl] [+]"
        }, {
            "val": "Zoom Out: Zooms out the text.",
            "key": "[Ctrl] [-]"
        }, {
            "val": "Zoom Reset: Reset any previous zoom on the text.",
            "key": "[Ctrl] [0]"
        }, {
            "val": "Fullscreen: Switches to fullscreen mode.",
            "key": "F11"
        }],
        "Finding text, selecting text": [{
            "val": "Find: Opens the Find dialog.",
            "key": "[Ctrl] [F]"
        }, {
            "val": "Find Next: Finds next result.",
            "key": "[Ctrl] [G]"
        }, {
            "val": "Find Previous: Finds previous result.",
            "key": "[Ctrl] [Shift] [G]"
        }, {
            "val": "Find in files: Opens the Find in files dialog.",
            "key": "[Ctrl] [Shift] [F]"
        }, {
            "val": "Switch to Search Bar: Switches to the search bar in the toolbar (if visible).",
            "key": "F7"
        }, {
            "val": "Find Usage: Finds all occurrences of the current word (near the keyboard cursor) or selection in all open documents and displays them in the messages window.",
            "key": "[Ctrl] [Shift] [E]"
        }, {
            "val": "Find Document Usage: Finds all occurrences of the current word (near the keyboard cursor) or selection in the current document and displays them in the messages window.",
            "key": "[Ctrl] [Shift] [D]"
        }, {
            "val": "Select current word: Selects the current word under the cursor.",
            "key": "[Alt] [Shift] [W]"
        }, {
            "val": "Select current line(s): Selects the current line under the cursor (and any partially selected lines).",
            "key": "[Alt] [Shift] [L]"
        }, {
            "val": "Select current paragraph: Selects the current paragraph under the cursor which is defined by two empty lines around it.",
            "key": "[Alt] [Shift] [P]"
        }, {
            "val": "Select all: Makes a selection of all text in the current document.",
            "key": "[Ctrl] [A]"
        }, {
            "val": "Column mode editing (rectangular selections): edits of the text within this selection will be done for every line in the selection.",
            "key": "[Control] [Shift]"
        }, {
            "val": "Column mode editing (rectangular selections): edits of the text within this selection will be done for every line in the selection.",
            "key": "[Control] [Alt]"
        }, {
            "val": "Mark All: Highlight all matches of the current word/selection in the current document with a colored box. If there's nothing to find, or the cursor is next to an existing match, the highlighted matches will be cleared.",
            "key": "[Ctrl] [Shift] [M]"
        }, {
            "val": "Toggle marker: Set a marker on the current line, or clear the marker if there already is one.",
            "key": "[Ctrl] [M]"
        }, {
            "val": "Go to previous marker: Go to the previous marker in the current document.",
            "key": "[Ctrl] [,]"
        }, {
            "val": "Go to next marker: Go to the next marker in the current document.",
            "key": "[Ctrl] [.]"
        }],
        "Cut and paste": [{
            "val": "Cut: Cut the current selection to the clipboard.",
            "key": "[Ctrl] [X]"
        }, {
            "val": "Cut current line(s): Cuts the current line (and any lines with a selection) to the clipboard.",
            "key": "[Ctrl] [Shift] [X]"
        }, {
            "val": "Copy: Copy the current selection to the clipboard.",
            "key": "[Ctrl] [C]"
        }, {
            "val": "Copy current line(s): Copies the current line (and any lines with a selection) to the clipboard.",
            "key": "[Ctrl] [Shift] [C]"
        }, {
            "val": "Paste: Paste the clipboard text into the current document.",
            "key": "[Ctrl] [V]"
        }, {
            "val": "Duplicate line or selection: Duplicates the current line or selection.",
            "key": "[Ctrl] [D]"
        }, {
            "val": "Delete to line end: Deletes from the current caret position to the end of the current line.",
            "key": "[Ctrl] [Shift] [Delete]"
        }, {
            "val": "Delete current line(s): Deletes the current line (and any lines with a selection).",
            "key": "[Ctrl] [K]"
        }],
        "Editing": [{
            "val": "Insert date: Inserts a customisable date.",
            "key": "[Shift] [Alt] [D]"
        }, {
            "val": "Toggle line commentation: Comments a line if it is not commented or removes a comment if the line is commented.",
            "key": "[Ctrl] [E]"
        }, {
            "val": "Toggle case of selection: Changes the case of the selection. A lowercase selection will be changed into uppercase and vice versa. If the selection contains lower- and uppercase characters, all will be converted to lowercase.",
            "key": "[Ctrl] [Alt] [U]"
        }, {
            "val": "Word part completion: When the autocompletion list is visible, complete the currently selected item up to the next word part.",
            "key": "Tab"
        }, {
            "val": "Complete snippet: If you type a construct like if or for and press this key, it will be completed with a matching template.",
            "key": "Tab"
        }, {
            "val": "Increase indent: Indents the current line or selection by one tab or by spaces in the amount of the tab width setting.",
            "key": "[Ctrl] [I]"
        }, {
            "val": "Decrease indent: Removes one tab or the amount of spaces of the tab width setting from the indentation of the current line or selection.",
            "key": "[Ctrl] [U]"
        }, {
            "val": "Move line(s) up: Move the current line or selected lines up by one line.",
            "key": "[Alt] [PageUp]"
        }, {
            "val": "Move line(s) down: Move the current line or selected lines down by one line.",
            "key": "[Alt] [PageDown]"
        }, {
            "val": "Complete word: Shows the autocompletion list. If already showing tag completion, it shows document word completion instead, even if it is not enabled for automatic completion. Likewise if no tag suggestions are available, it shows document word completion.",
            "key": "[Ctrl] [Space]"
        }, {
            "val": "Go to tag declaration: Jump to the declaration of the current word or selection. See Go to tag declaration.",
            "key": "[Ctrl] [Shift] [T]"
        }, {
            "val": "Go to tag definition: Jump to the definition of the current word or selection. See Go to tag definition.",
            "key": "[Ctrl] [T]"
        }, {
            "val": "Undo: Un-does the last action.",
            "key": "[Ctrl] [Z]"
        }, {
            "val": "Redo: Re-does the last action.",
            "key": "[Ctrl] [Y]"
        }, {
            "val": "Replace: Opens the Replace dialog.",
            "key": "[Ctrl] [H]"
        }, {
            "val": "Send to Custom Command 1 (2,3): Passes the current selection to a configured external command (available for the first three configured commands, see Sending text through custom commands for details).",
            "key": "[Ctrl] [1 (2,3)]"
        }, {
            "val": "Show calltip: Shows a calltip for the current function or method.",
            "key": "[Ctrl] [Shift] [Space]"
        }],
        "Files": [{
            "val": "New: Creates a new file.",
            "key": "[Ctrl] [N]"
        }, {
            "val": "Open: Opens a file.",
            "key": "[Ctrl] [O]"
        }, {
            "val": "Open selected file: Opens the selected filename.",
            "key": "[Ctrl] [Shift] [O]"
        }, {
            "val": "Reload file: Reloads the current file. All unsaved changes will be lost.",
            "key": "[Ctrl] [R]"
        }, {
            "val": "Switch to last used document: Switches to the previously shown document (if it's still open). Holding Ctrl (or another modifier if the keybinding has been changed) will show a dialog, then repeated presses of the keybinding will switch to the 2nd-last used document, 3rd-last, etc. Also known as Most-Recently-Used documents switching.",
            "key": "[Ctrl] [Tab]"
        }, {
            "val": "Save: Saves the current file.",
            "key": "[Ctrl] [S]"
        }, {
            "val": "Save all: Saves all open files.",
            "key": "[Ctrl] [Shift] [S]"
        }, {
            "val": "Close: Closes the current file.",
            "key": "[Ctrl] [W]"
        }, {
            "val": "Close all: Closes all open files.",
            "key": "[Ctrl] [Shift] [W]"
        }, {
            "val": "Print: Prints the current file.",
            "key": "[Ctrl] [P]"
        }, {
            "val": "Quit: Quits Geany.",
            "key": "[Ctrl] [Q]"
        }],
        "Build, make and compile": [{
            "val": "Preferences: Opens preferences dialog.",
            "key": "[Ctrl] [Alt] [P]"
        }, {
            "val": "Build: Builds (compiles if necessary and links) the current file.",
            "key": "F9"
        }, {
            "val": "Make object: Compiles the current file with the Make tool.",
            "key": "[Shift] [F8]"
        }, {
            "val": "Make all: Builds the current file with the Make tool.",
            "key": "[Shift] [F9]"
        }, {
            "val": "Compile: Compiles the current file.",
            "key": "F8"
        }, {
            "val": "Run: Executes the current file in a terminal emulation.",
            "key": "F5"
        }, {
            "val": "Show macro list: Shows a list of available macros and variables in the workspace.",
            "key": "[Ctrl] [Return]"
        }, {
            "val": "Make custom target: Builds the current file with the Make tool and a given target.",
            "key": "[Ctrl] [Shift] [F9]"
        }, {
            "val": "Reload symbol list: Reloads the tag/symbol list.",
            "key": "[Ctrl] [Shift] [R]"
        }],
        "Other": [{
            "val": "Switch to Editor: Switches to editor widget. Also reshows the document statistics line (after a short timeout).",
            "key": "F2"
        }, {
            "val": "Switch to VTE: Switches to VTE widget.",
            "key": "F4"
        }, {
            "val": "Switch to Scribble: Switches to scribble widget.",
            "key": "F6"
        }, {
            "val": "Help: Opens the manual.",
            "key": "F1"
        }]
    }
}
