{
  "id": "html_cheat_sheet",
  "name": "HTML Elements",
  "metadata": {
    "sourceName": "Mozilla Developer Network",
    "sourceUrl": "https://developer.mozilla.org/en-US/docs/Web/HTML/Element"
  },
  "aliases": [
    "html5",
    "html 5"
  ],
  "template_type": "reference",
  "section_order": [
    "Document metadata",
    "Content sectioning",
    "Text content",
    "Inline text semantics",
    "Image and multimedia",
    "Table content",
    "Forms",
    "Embedded content",
    "Scripting"
  ],
  "sections": {
    "Document metadata": [
      {
        "key": "<head>",
        "val": "The HTML Head Element (<head>) provides general information (metadata) about the document, including its title and links to or definitions of scripts and style sheets"
      },
      {
        "key": "<link>",
        "val": "The HTML Link Element (<link>) specifies relationships between the current document and an external resource. Possible uses for this element include defining a relational framework for navigation. This Element is most used to link to style sheets."
      },
      {
        "key": "<meta>",
        "val": "The HTML Meta Element (<meta>) represents any metadata information that cannot be represented by one of the other HTML meta-related elements (<base>, <link>, <script>, <style> or <title>)."
      },
      {
        "key": "<style>",
        "val": "The HTML Style Element (<style>) contains style information for a document, or part of a document. By default, the style instructions written inside that element are expected to be CSS."
      },
      {
        "key": "<title>",
        "val": "The HTML Title Element (<title>) defines the title of the document, shown in a browser's title bar or on the page's tab. It can only contain text and any contained tags are not interpreted."
      }
    ],
    "Content sectioning": [
      {
        "key": "<address>",
        "val": "The HTML Address Element (<address>) should be used by authors to supply contact information for its nearest <article> or <body> ancestor; in the latter case, it applies to the whole document."
      },
      {
        "key": "<article>",
        "val": "The HTML Article Element (<article>) represents a self-contained composition in a document, page, application, or site, which is intended to be independently distributable or reusable, e.g., in syndication. This could be a forum post, a magazine or newspaper article, a blog entry, or any other independent item of content. Each <article> should be identified, typically by including a heading (h1-h6 element) as a child of the <article> element."
      },
      {
        "key": "<body>",
        "val": "The HTML Body Element (<body>) represents the content of an HTML document. There can be only one <body> element in a document."
      },
      {
        "key": "<footer>",
        "val": "The HTML Footer Element (<footer>) represents a footer for its nearest sectioning content or sectioning root element. A footer typically contains information about the author of the section, copyright data or links to related documents."
      },
      {
        "key": "<header>",
        "val": "The HTML <header> Element represents a group of introductory or navigational aids. It may contain some heading elements but also other elements like a logo, wrapped section's header, a search form, and so on."
      },
      {
        "key": "<h1>, <h2>, <h3>, <h4>, <h5>, <h6>",
        "val": "Heading elements implement six levels of document headings, <h1> is the most important and <h6> is the least. A heading element briefly describes the topic of the section it introduces. Heading information may be used by user agents, for example, to construct a table of contents for a document automatically."
      },
      {
        "key": "<hgroup>",
        "val": "The HTML <hgroup> Element (HTML Headings Group Element) represents the heading of a section. It defines a single title that participates in the outline of the document as the heading of the implicit or explicit section that it belongs to."
      },
      {
        "key": "<nav>",
        "val": "The HTML Navigation Element (<nav>) represents a section of a page that links to other pages or to parts within the page: a section with navigation links."
      },
      {
        "key": "<section>",
        "val": "The HTML Section Element (<section>) represents a generic section of a document, i.e., a thematic grouping of content, typically with a heading. Each <section> should be identified, typically by including a heading (<h1>-<h6> element) as a child of the <section> element."
      }
    ],
    "Text content": [
      {
        "key": "<div>",
        "val": "The HTML <div> element (or HTML Document Division Element) is the generic container for flow content, which does not inherently represent anything. It can be used to group elements for styling purposes (using the class or id attributes), or because they share attribute values, such as lang. It should be used only when no other semantic element (such as <article> or <nav>) is appropriate."
      },
      {
        "key": "<dd>",
        "val": "The HTML Description Element (<dd>) indicates the description of a term in a description list (<dl>) element. This element can occur only as a child element of a definition list and it must follow a <dt> element."
      },
      {
        "key": "<dl>",
        "val": "The HTML <dl> Element (or HTML Description List Element) encloses a list of pairs of terms and descriptions. Common uses for this element are to implement a glossary or to display metadata (a list of key-value pairs)."
      },
      {
        "key": "<dt>",
        "val": "The HTML <dt> element (or HTML Definition Term Element) identifies a term in a definition list. This element can occur only as a child element of a <dl>. It is usually followed by a <dd> element; however, multiple <dt> elements in a row indicate several terms that are all defined by the immediate next <dd> element."
      },
      {
        "key": "<hr>",
        "val": "The HTML <hr> element represents a thematic break between paragraph-level elements (for example, a change of scene in a story, or a shift of topic with a section). In previous versions of HTML, it represented a horizontal rule. It may still be displayed as a horizontal rule in visual browsers, but is now defined in semantic terms, rather than presentational terms."
      },
      {
        "key": "<li>",
        "val": "The HTML List Item Element (<li>) is used to represent an item in a list. It must be contained in a parent element: an ordered list (<ol>), an unordered list (<ul>), or a menu (<menu>). In menus and unordered lists, list items are usually displayed using bullet points. In ordered lists, they are usually displayed with an ascending counter on the left, such as a number or letter."
      },
      {
        "key": "<ol>",
        "val": "The HTML <ol> Element (or HTML Ordered List Element) represents an ordered list of items. Typically, ordered-list items are displayed with a preceding numbering, which can be of any form, like numerals, letters or Romans numerals or even simple bullets. This numbered style is not defined in the HTML description of the page, but in its associated CSS, using the list-style-type property."
      },
      {
        "key": "<p>",
        "val": "The HTML <p> element (or HTML Paragraph Element) represents a paragraph of text."
      },
      {
        "key": "<pre>",
        "val": "The HTML Preformatted Text (<pre>) represents preformatted text. Text within this element is typically displayed in a non-proportional font exactly as it is laid out in the file. Whitespaces inside this element are displayed as typed."
      },
      {
        "key": "<ul>",
        "val": "The HTML unordered list element (<ul>) represents an unordered list of items, namely a collection of items that do not have a numerical ordering, and their order in the list is meaningless. Typically, unordered-list items are displayed with a bullet, which can be of several forms, like a dot, a circle or a squared. The bullet style is not defined in the HTML description of the page, but in its associated CSS, using the list-style-type property."
      }
    ],
    "Inline text semantics": [
      {
        "key": "<a>",
        "val": "The HTML Anchor Element (<a>) defines a hyperlink to a location on the same page or any other page on the Web. It can also be used (in an obsolete way) to create an anchor point—a destination for hyperlinks within the content of a page, so that links aren't limited to connecting simply to the top of a page."
      },
      {
        "key": "<abbr>",
        "val": "The HTML Abbreviation element (<abbr>) represents an abbreviation and optionally provides a full description for it. If present, the title attribute must contain this full description and nothing else."
      },
      {
        "key": "<b>",
        "val": "The HTML <b> Element represents a span of text stylistically different from normal text, without conveying any special importance or relevance. It is typically used for keywords in a summary, product names in a review, or other spans of text whose typical presentation would be boldfaced. Another example of its use is to mark the lead sentence of each paragraph of an article."
      },
      {
        "key": "<br>",
        "val": "The HTML <br> Element (or HTML Line Break Element) produces a line break in text (carriage-return). It is useful for writing a poem or an address, where the division of lines is significant."
      },
      {
        "key": "<code>",
        "val": "The HTML Code Element (<code>) represents a fragment of computer code. By default, it is displayed in the browser's default monospace font."
      },
      {
        "key": "<em>",
        "val": "The HTML Emphasis Element (<em>) marks text that has stress emphasis. The <em> element can be nested, with each level of nesting indicating a greater degree of emphasis."
      },
      {
        "key": "<i>",
        "val": "The HTML <i> Element represents a range of text that is set off from the normal text for some reason, for example, technical terms, foreign language phrases, or fictional character thoughts. It is typically displayed in italic type."
      },
      {
        "key": "<s>",
        "val": "The HTML Strikethrough Element (<s>) renders text with a strikethrough, or a line through it. Use the <s> element to represent things that are no longer relevant or no longer accurate. However, <s> is not appropriate when indicating document edits; for that, use the <del> and <ins> elements, as appropriate."
      },
      {
        "key": "<span>",
        "val": "The HTML <span> element is a generic inline container for phrasing content, which does not inherently represent anything. It can be used to group elements for styling purposes (using the class or id attributes), or because they share attribute values, such as lang. It should be used only when no other semantic element is appropriate. <span> is very much like a <div> element, but <div> is a block-level element whereas a <span> is an inline element."
      },
      {
        "key": "<strong>",
        "val": "The HTML Strong Element (<strong>) gives text strong importance, and is typically displayed in bold."
      },
      {
        "key": "<u>",
        "val": "The HTML Underline Element (<u>) renders text with an underline, a line under the baseline of its content."
      }
    ],
    "Image and multimedia": [
      {
        "key": "<area>",
        "val": "The HTML <area> element defines a hot-spot region on an image, and optionally associates it with a hypertext link. This element is used only within a <map> element."
      },
      {
        "key": "<audio>",
        "val": "The HTML <audio> element is used to embed sound content in documents. It may contain several audio sources, represented using the src attribute or the <source> element; the browser will choose the most suitable one."
      },
      {
        "key": "<img>",
        "val": "The HTML Image Element (<img>) represents an image of the document."
      },
      {
        "key": "<map>",
        "val": "The HTML <map> element is used with <area> elements to define an image map (a clickable link area)."
      },
      {
        "key": "<track>",
        "val": "The HTML <track> element is used as a child of the media elements—<audio> and <video>. It lets you specify timed text tracks (or time-based data), for example to automatically handle subtitles. The tracks are formatted in WebVTT format (.vtt files) — Web Video Text Tracks."
      },
      {
        "key": "<video>",
        "val": "The HTML <video> element is used to embed video content. It may contain several video sources, represented using the src attribute or the <source> element; the browser will choose the most suitable one."
      }
    ],
    "Table content": [
      {
        "key": "<caption>",
        "val": "     The HTML <caption> Element (or HTML Table Caption Element) represents the title of a table. Though it is always the first descendant of a <table>, its styling, using CSS, may place it elsewhere, relative to the table."
      },
      {
        "key": "<col>",
        "val": "The HTML Table Column Element (<col>) defines a column within a table and is used for defining common semantics on all common cells. It is generally found within a <colgroup> element."
      },
      {
        "key": "<colgroup>",
        "val": "The HTML Table Column Group Element (<colgroup>) defines a group of columns within a table."
      },
      {
        "key": "<table>",
        "val": "The HTML Table Element (<table>) represents data in two dimensions or more."
      },
      {
        "key": "<tbody>",
        "val": "The HTML Table Body Element (<tbody>) represents a block of rows that consist of a body of data for the parent\n table element, if the tbody element has a parent and it is a table."
      },
      {
        "key": "<td>",
        "val": "The Table cell HTML element (<td>) defines a cell of a table that contains data. It participates in the table model."
      },
      {
        "key": "<tfoot>",
        "val": "The HTML Table Foot Element (<tfoot>) defines a set of rows summarizing the columns of the table."
      },
      {
        "key": "<th>",
        "val": "The HTML Table Header Cell Element (<th>) defines a cell that is a header for a group of cells of a table. The group of cells that the header refers to is defined by the scope and headers attribute."
      },
      {
        "key": "<thead>",
        "val": "The HTML Table Head Element (<thead>) defines a set of rows defining the head of the columns of the table."
      },
      {
        "key": "<tr>",
        "val": "The HTML Table Row Element (<tr>) defines a row of cells in a table. Those can be a mix of <td> and <th> elements."
      }
    ],
    "Forms": [
      {
        "key": "<button>",
        "val": "The HTML <button> Element represents a clickable button."
      },
      {
        "key": "<datalist>",
        "val": "The HTML Datalist Element (<datalist>) contains a set of <option> elements that represent the values available for other controls."
      },
      {
        "key": "<fieldset>",
        "val": "The HTML <fieldset> element is used to group several controls as well as labels (<label>) within a web form."
      },
      {
        "key": "<form>",
        "val": "The HTML <form> element represents a document section that contains interactive controls to submit information to a web server."
      },
      {
        "key": "<input>",
        "val": "The HTML <input> element is used to create interactive controls for web-based forms in order to accept data from the user. How an <input> works varies considerably depending on the value of its type attribute."
      },
      {
        "key": "<keygen>",
        "val": "The HTML <keygen> element exists to facilitate generation of key material, and submission of the public key as part of an HTML form. This mechanism is designed for use with Web-based certificate management systems. It is expected that the <keygen> element will be used in an HTML form along with other information needed to construct a certificate request, and that the result of the process will be a signed certificate."
      },
      {
        "key": "<label>",
        "val": "The HTML Label Element (<label>) represents a caption for an item in a user interface. It can be associated with a control either by placing the control element inside the <label> element, or by using the for attribute. Such a control is called the labeled control of the label element."
      },
      {
        "key": "<legend>",
        "val": "The HTML <legend> Element (or HTML Legend Field Element) represents a caption for the content of its parent <fieldset>."
      },
      {
        "key": "<meter>",
        "val": "The HTML <meter> Element represents either a scalar value within a known range or a fractional value."
      },
      {
        "key": "<optgroup>",
        "val": "In a Web form, the HTML <optgroup> element  creates a grouping of options within a <select> element."
      },
      {
        "key": "<option>",
        "val": "In a Web form, the HTML <option> element is used to create a control representing an item within a <select>, an <optgroup> or a <datalist> HTML5 element."
      },
      {
        "key": "<output>",
        "val": "The HTML <output> element represents the result of a calculation or user action."
      },
      {
        "key": "<progress>",
        "val": "The HTML <progress> Element is used to view the completion progress of a task. While the specifics of how it's displayed is left up to the browser developer, it's typically displayed as a progress bar. Javascript can be used to manipulate the value of progress bar."
      },
      {
        "key": "<select>",
        "val": "The HTML select (<select>) element represents a control that presents a menu of options. The options within the menu are represented by <option> elements, which can be grouped by <optgroup> elements. Options can be pre-selected for the user."
      },
      {
        "key": "<textarea>",
        "val": "The HTML <textarea> element represents a multi-line plain-text editing control."
      }
    ],
    "Embedded content": [
      {
        "key": "<embed>",
        "val": "     The HTML <embed> Element represents an integration point for an external application or interactive content (in other words, a plug-in)."
      },
      {
        "key": "<iframe>",
        "val": "The HTML Inline Frame Element (<iframe>) represents a nested browsing context, effectively embedding another HTML page into the current page. In HTML 4.01, a document may contain a head and a body or a head and a frame-set, but not both a body and a frame-set. However, an <iframe> can be used within a normal document body. Each browsing context has its own session history and active document. The browsing context that contains the embedded content is called the parent browsing context. The top-level browsing context (which has no parent) is typically the browser window."
      },
      {
        "key": "<object>",
        "val": "The HTML Embedded Object Element (<object>) represents an external resource, which can be treated as an image, a nested browsing context, or a resource to be handled by a plugin."
      },
      {
        "key": "<param>",
        "val": "The HTML <param> Element (or HTML Parameter Element) defines parameters for <object>."
      },
      {
        "key": "<source>",
        "val": "The HTML <source> element is used to specify multiple media resources for <picture>, <audio> and <video> elements. It is an empty element. It is commonly used to serve the same media in multiple formats supported by different browsers."
      }
    ],
    "Scripting": [
      {
        "key": "<canvas>",
        "val": "The HTML <canvas> Element can be used to draw graphics via scripting (usually JavaScript). For example, it can be used to draw graphs, make photo compositions or even perform animations. You may (and should) provide alternate content inside the <canvas> block. That content will be rendered both on older browsers that don't support canvas and in browsers with JavaScript disabled."
      },
      {
        "key": "<noscript>",
        "val": "The HTML <noscript> Element defines a section of html to be inserted if a script type on the page is unsupported or if scripting is currently turned off in the browser."
      },
      {
        "key": "<script>",
        "val": "     The HTML Script Element (<script>) is used to embed or reference an executable script within an HTML or XHTML document."
      }
    ]
  }
}
