{
    "id":"kabaddi_terms_cheat_sheet",
    "name":"Kabaddi Terms and Definitions",
    "description": "Common terms used in kabaddi and their definitions.",
    "metadata": {
        "sourceName": "ProKabaddi League",
        "sourceUrl": "http://www.prokabaddi.com/prokabaddi-rules"
    },
    "aliases": [
		"kabaddi",
		"kabaddi words",
		"kabaddi definitions",
		"terms used in kabaddi"
	],
    "template_type": "reference",
    "section_order": [
        "Court related terms",
        "Play related terms"
    ],
    "sections": {
        "Court related terms": [
            {
                "key": "Field of Play",
                "val": "The area which shall be covered with the AKFI approved playing mats measuring a minimum of 17 meters x 18 meters and maximum of 20 meters x 20 meters."
            },
            {
                "key": "Court",
                "val": "The area on which the Pro Kabaddi matches shall be conducted measuring 13 meters x 10 meters. Court is within the Field of Play, represented through lines (points ABCD as indicated in the above diagram)."
            },
            {
                "key": "End Line",
                "val": "The four boundary lines forming the court together (AB, BC, CD and DA as indicated in the above diagram). All end lines shall be of 3 to 5 cm width."
            },
            {
                "key": "Lobby",
                "val": "The yellow strips on both sides of the court measuring 1 meter in width."
            },
            {
                "key": "Mid Line",
                "val": "The line that divides the play field into two equal halves."
            },
            {
                "key": "Half Court",
                "val": "Each half of the court divided by the mid line."
            },
            {
                "key": "Baulk Line",
                "val": "Each of the lines in court parallel to the mid line. The distance of the baulk line from the mid line is 3.75 meter"
            },
            {
                "key": "Bonus Line",
                "val": "The line between the baulk line and end line. The distance between Bonus line and Baulk line is 1 meter."
            },
            {
                "key": "Cant",
                "val": "The repeated chanting of the approved word “Kabaddi”. The chanting should be without break, at a stretch, and clear aloud sounding."
            }
        ],
       "Play related terms": [
            {
                "key": "Raider",
                "val": "The player that enters into the opponents’ half court with the cant. The raider must begin his cant before he crosses the mid line to enter the opponents’ half court."
            },
            {
                "key": "Defender",
                "val": "Any player who is in his half court when the raider from the opponents’ side is raiding."
            },
            {
                "key": "To put out a Defender",
                "val": "The defender being declared out when a raider touches the defender without any breach in rules of play, or if any part of the body of the defender touches any part of the raider, and then the raider touches his court with the cant."
            },
            {
                "key": "To hold a Raider",
                "val": "If the if the defender or defenders hold the raider without any breach in the rules of play and keep the raider in their court and do not allow him to reach his court until he loses his cant or the Referee/Umpire blows the whistle."
            },
            {
                "key": "Touch",
                "val": "If the raider touches any one or more defender by any part of his body including the defenders clothing, shoes and any other apparel he may be wearing."
            },
            {
                "key": "Struggle",
                "val": "When one of more defenders come into contact with the raider. After touch or struggle, the lobbies are activated and included as part of the court."
            },
            {
                "key": "Raid",
                "val": "When the raider enters the court of opponent with cant. Each raid is restricted to 30 seconds (in both the halves). The clocks will be set / reset as raider crosses the center line or when the raid is over."
            },
            {
                "key": "Empty Raid",
                "val": "When the raider crosses the Baulk line of the defending team at least once during the course of a raid and returns to his court with cant without scoring any points."
            },
            {
                "key": "Pursuit",
                "val": "When a defender rushes into the opponent’s court with cant, and without any breach in rules of play, chasing the returning raider with a view to touch."
            },
            {
                "key": "Super Catch",
                "val": "When the raider is successfully tackled by 3 defenders or less."
            }
        ]
    }
}
