{
    "id": "window_managers_cheat_sheet",
    "name": "Window Managers",
    "description": "Window manager is a system software that controls the placement and appearance of windows within a windowing system in a graphical user interface",

    
    
    "aliases": [
        "window manager", "window manager list"
    ],

    "template_type": "reference",

    "section_order": [
        "Active 1",
        "Active 2",
        "Discontinued"
    ],

    "sections": {
        "Active 1": [
            {
                "key": "AfterStep",
                "val": "AfterStep is a stacking window manager for the X Window System. The goal of AfterStep's development is to provide for flexibility of desktop configuration, improved aesthetics and efficient use of system resources, and was used in such distributions as MachTen"
            },
            {
                "key": "Awesome",
                "val": "Awesome is a highly configurable, next generation framework window manager for X. It is very fast, extensible and licensed under the GNU GPLv2 license"
            },
            {
                "key": "bspwm",
                "val": "Bspwm is a tiling window manager designed for X11, and written in C. It supports tiling, stacking, and tabbing layouts, which it handles dynamically"
            },
            {
                "key": "dwm",
                "val": "Dwm is a dynamic window manager for X. It manages windows in tiled, monocle and floating layouts. All of the layouts can be applied dynamically, optimising the environment for the application in use and the task performed"
            },
            {
                "key": "Enlightenment",
                "val": "Enlightenment, also known simply as E, is a compositing and stacking window manager for the X Window System. Since version 20, Enlightenment is also a Wayland compositor"
            },
            {
                "key": "Fluxbox",
                "val": "Fluxbox is a windowmanager for X that was based on the Blackbox 0.61.1 code. It is very light on resources and easy to handle but yet full of features to make an easy, and extremely fast, desktop experience. It is built using C++ and licensed under the MIT-License"
            },
            {
                "key": "FLWM",
                "val": "The Fast Light Window Manager is a stacking window manager written in C++ and available for redistribution under the terms of the GNU General Public Licence. FLWM is the default window manager for Tiny Core Linux"
            }
        ],
        "Active 2": [
            {
                "key": "FVWM",
                "val": "The F Virtual Window Manager is a virtual window manager for the X Window System. Originally a twm derivative, FVWM has evolved into a powerful and highly configurable environment for Unix-like systems"
            },
            {
                "key": "i3",
                "val": "I3 is a tiling window manager, completely written from scratch. The target platforms are GNU/Linux and BSD operating systems, our code is Free and Open Source Software (FOSS) under the BSD license"
            },
            {
                "key": "IceWM",
                "val": "IceWM is a stacking window manager for the X Window System graphical infrastructure, written by Marko Maček. It was written from scratch in C++ and is released under the terms of the GNU Lesser General Public License"
            },
            {
                "key": "JWM",
                "val": "Joe's Window Manager is a light-weight window manager for the X11 Window System. JWM is written in C and uses only Xlib at a minimum. Because of its small footprint, JWM makes a good window manager for older computers and less powerful systems"
            },
            {
                "key": "Openbox",
                "val": "Openbox is a highly configurable, next generation window manager with extensive standards support"
            },
            {
                "key": "pekwm",
                "val": "Pekwm is a window manager that once upon a time was based on the aewm++ window manager, but it has evolved enough that it no longer resembles aewm++ at all. It has a much expanded feature-set, including window grouping, autoproperties, xinerama, keygrabber that supports keychains, and much more"
            },
            {
                "key": "TWM",
                "val": "TWM is a window manager for the X Window System. Started in 1987 by Tom LaStrange, it has been the standard window manager for the X Window System since version X11R4"
            },
            {
                "key": "Wmaker",
                "val": "Window Maker is an X11 window manager originally designed to provide integration support for the GNUstep Desktop Environment. In every way possible, it reproduces the elegant look and feel of the NEXTSTEP user interface. It is fast, feature rich, easy to configure, and use"
            }
        ],
        "Discontinued": [
            {
                "key": "Blackbox",
                "val": "Blackbox is a stacking window manager for the X Window System"
            },
            {
                "key": "HackedBox",
                "val": "Hackedbox is a stripped down version of Blackbox, the X11 window manager (GPL, Desktop Environment, Window Manager)"
            },
            {
                "key": "Ion",
                "val": "Ion is a tiling and tabbing window manager for the X Window System. It is designed such that it is possible to manage windows using only a keyboard, without needing a mouse"
            },
            {
                "key": "Metacity",
                "val": "Metacity is a window manager that was used by the GNOME 2 desktop environment"
            },
            {
                "key": "Ratpoison",
                "val": "Ratpoison is a simple Window Manager with no fat library dependencies, no fancy graphics, no window decorations, and no rodent dependence. It is largely modelled after GNU Screen which has done wonders in the virtual terminal market"
            },
            {
                "key": "SLWM",
                "val": "SLWM is a new concept in window management. Its goal is to be a hybrid of a tiled and regular window manager, with the addition of an infinite desktop. All windows are also headless"
            },
            {
                "key": "WMFS",
                "val": "Window Manager From Scratch, A tiling window manager highly configurable"
            },
            {
                "key": "wmii",
                "val": "Window manager improved is a small, scriptable window manager for X11, with a 9P filesystem interface and an acme-like layout"
            }
        ]
    }
}
