{"Tuesday August 6":[{"desc":"With the first shark attack in the state of Massachusetts for nearly 80 years, RETURN OF JAWS reveals brand new revelations about how the Great Whites live and hunt off Cape Cod by tracking a 17-ft shark with a robot submarine -- a Shark Week first.","time":"12:00 AM","title":"Return of Jaws"},{"desc":"There have been rumors of a monster shark living in bayous of Louisiana. A team of Cajun fishermen head out to prove its existence while a shark scientist attempts to research bull sharks living in a freshwater lake just outside of New Orleans.","time":"1:00 AM","title":"Voodoo Sharks"},{"desc":"LIVE late night shark show! Josh swims with sharks and is joined by Lord of the Rings star Dominic Monaghan.","time":"2:00 AM","title":"Shark After Dark LIVE"},{"desc":"A menacing predator the size of a Greyhound bus roamed Earth&#39;s ancient oceans making meals of whales. This &#34;megatooth&#34; is believed to weigh 20 times more than a large great white today.","time":"9:00 AM","title":"Prehistoric Sharks"},{"desc":"The Tiger Shark has a reputation among divers rivaling that of the notorious Great White. Like other dangerous species it&#39;s known to attack human beings, but unlike any of the others, it is capable of finishing the job and consuming the body.","time":"10:00 AM","title":"Deadly Stripes: Tiger Sharks"},{"desc":"Researchers, analyzing data from new satellite technology, have discovered that the great white shark makes incredible long-distance migrations across the Pacific. Transmitters attached to the sharks may soon reveal hidden birthing and mating grounds.","time":"11:00 AM","title":"Jaws of the Pacific"},{"desc":"Host Terry Schappert puts his Special Forces training to the test to demonstrate to viewers how to survive devastating shark attacks. Terry immerses himself in several deadly scenarios and reveals the secrets to escaping terrifying shark encounters alive.","time":"12:00 PM","title":"Shark Attack Survival Guide"},{"desc":"LIVE late night shark show! Josh swims with sharks and is joined by Lord of the Rings star Dominic Monaghan.","time":"1:00 PM","title":"Shark After Dark LIVE"},{"desc":"A team of amatuer shark enthusiasts travel to the Bahamas to swim with sharks and test just how hard it is to be bitten by a shark...or is it? Tiger sharks, lemon sharks, and Caribbean Reef sharks appear for the experiments.","time":"2:00 PM","title":"How Not To Become Shark Bait"},{"desc":"One of the most feared predators on earth, the great white shark seems to be the perfect hunter. But, there is still so little known about this creature. Former Marine Charles Ingram travels the globe, testing and learning the limits of these sharks.","time":"3:00 PM","title":"Great White Appetite"},{"desc":"Late, Late Show host Craig Ferguson heads to the Bahamas for the adventure of a lifetime: swimming with sharks! But as he gets closer to actually jumping into the water, he starts to worry. He&#39;s in for a surprise when he finally gets underwater....","time":"4:00 PM","title":"Shark Bites: Adventures in Shark Week"},{"desc":"Great Whites are back in the very same waters JAWS was made. Shark expert Greg Skomal is high alert as a huge, 18 foot Great White is spotted off Chatham, MA&#39;s beaches. Why have they returned? Where are they going? Is it safe to go back in the water?","time":"5:00 PM","title":"Jaws Comes Home"},{"desc":"These are six of the most extreme shark attacks you’ll ever see on television. But what’s even more remarkable is that the survivors, permanently scarred by their attacks, have joined forces to rescue the awesome creatures that nearly killed them.","time":"6:00 PM","title":"Shark Fight"},{"desc":"In 1975, the world’s first summer blockbuster created a monster. As soon as Jaws hit the screens, fear of Great Whites sharks swept the nation, prompting hunters to kill them. But the movie also inspired a growing curiosity that transformed shark science.","time":"7:00 PM","title":"How Jaws Changed The World"},{"desc":"This special Sharktweeto episode has bite with your live tweets, bonus scenes, and facts. Jaws is back and ready to attack, maybe. Shark experts must track these Great White sharks to find out if they have returned to the waters of this popular beach.","time":"8:00 PM","title":"Return of Jaws: Sharktweeto"},{"desc":"These are the harrowing first-hand tales, many caught on camera, of people who stared into the jaws of a shark and survived.","time":"9:00 PM","title":"I Escaped Jaws"},{"desc":"Maverick scientist Michael Domeier launches a dangerous mission. Helped by Fast &#38; Furious star Paul Walker, he risks life and limb to unravel the mystery of where Jaws gives birth... by getting within arm&#39;s reach of the ocean&#39;s fiercest predator.","time":"10:00 PM","title":"Spawn of Jaws"},{"desc":"LIVE late night shark show! Celeb guest Mark Cuban, Tara Reid talks Sharknado, and more.","time":"11:00 PM","title":"Shark After Dark LIVE"}],"Monday August 12":[{"desc":"$1 million in debt and determined to find gold, Scott and George head back to Ghana. They face armed guards, life threatening road accidents and violent confrontations in a desperate attempt to get their excavators back and save their mining deal.","time":"12:00 AM","title":"Jungle Gold"},{"desc":"Scott and George’s African gold mining dream turns sour and drives them ever deeper into debt. They try to join forces with a gang of traditional miners to dig by hand and their relationship with mining partners Chris and Singh reaches meltdown.","time":"1:00 AM","title":"Jungle Gold"},{"desc":"Scott and George test out a brand new claim after racking up huge debts on the Romaso gold mine. They have to prove the new claim is stacked with gold or their investors will pull funding. George risks it all in an outrageous and dangerous gold hustle.","time":"2:00 AM","title":"Jungle Gold"},{"desc":"After 7 years, it&#39;s back to unsolved Myth-teries: Can Adam&#39;s snowflake of death or Jamie&#39;s special sphere paint a room with a boom? Then, the fans demand the return to the cursed, bifurcated boat myth to see if it can be split in two by a channel marker.","time":"9:00 AM","title":"MythBusters (Season 9)"},{"desc":"Lost in the wilderness, Adam and Jamie survive the desert, repel down canyon cliff-faces, and brave Class 5 rapids, all with duct tape and bubble wrap. Guest appearance by Nik Wallenda, famous tightrope walker, who has his own way to traverse the canyon.","time":"10:00 AM","title":"MythBusters (Season 9)"},{"desc":"In a desperate attempt to repay his debts to Ohio boss Merlin, John sets up an illegal buggy race in the heart of Levi&#39;s territory. Esther lures Levi away and makes a shocking revelation that will alter the balance of power in Lancaster, PA.","time":"11:00 AM","title":"Amish Mafia"},{"desc":"Levi&#39;s crew splinters just as his war with Ohio boss Merlin escalates. Each member of Levi&#39;s crew has to decide if they will leave or stand by Levi and fight.","time":"12:00 PM","title":"Amish Mafia"},{"desc":"Tickle builds a new still and heads on a midnight run. Josh goes ballistic when he damages the nearly completed underground still site. Mark &#38; Jeff make a risky move when they sell their shine in town. Jim Tom teaches Jeff&#39;s son Lance how to proof shine.","time":"1:00 PM","title":"Moonshiners (Season 2)"},{"desc":"Tickle goes it alone after his still hand Howard gets spooked by an intruder and disappears.Josh &#38; Bill discover toxic black mold in their underground still site.Jeff&#39;s wife and son set up a second still to run barley scotch.Deputy Sheriff Chuck closes in","time":"2:00 PM","title":"Moonshiners (Season 2)"},{"desc":"Tickle gets busted by an angry landowner, while Tim devises an ingenious new hiding spot for his back-up stash of shine. Then, Josh &#38; Bill get into a bone-breaking fight at their new still site. Also, Mark bootlegs moonshine by canoe in the dead of night.","time":"3:00 PM","title":"Moonshiners (Season 2)"}],"Saturday August 10":[{"desc":"After having their rent raised by the Southie crew, the Rozzie crew must take a huge risk on a playoff hockey game. Tin Man finally lets his anger issues get the best of him and Pat Nee asks his crew to retrieve a very sensitive item.","time":"12:00 AM","title":"Saint Hoods"},{"desc":"Divers risk it all in Australia’s treacherous shark-infested waters to capture a valuable sea creature -- a million dollar bounty, if they can survive the great white gauntlet.","time":"1:00 AM","title":"Great White Gauntlet"},{"desc":"The Hoffman crew flies to Chile in hopes of getting a slice of the country’s 3,750 tons of untapped gold reserves. They prospect on a remote beach and high in the Andes Mountains, pushing the crew to its limits.","time":"2:00 AM","title":"Gold Rush South America (Season 4)"},{"desc":"A small group of American airmen. A flimsy life-raft. And hundreds of hungry sharks. This is the most extraordinary story of survival in US history.","time":"9:00 AM","title":"Adrift: 47 Days with Sharks"},{"desc":"Dave and Cody of Dual Survival dive in to investigate why no two species of shark attack in the same manner. Through a series of groundbreaking tests and innovative high-tech camera technologies, they&#39;ll reveal exactly why sharks are so deadly.","time":"10:00 AM","title":"How Sharks Hunt"},{"desc":"Divers risk it all in Australia’s treacherous shark-infested waters to capture a valuable sea creature -- a million dollar bounty, if they can survive the great white gauntlet.","time":"11:00 AM","title":"Great White Gauntlet"},{"desc":"Scientists embark on an expedition to film bizarre, deadly and extremely rare sharks of the deep sea. Their search reveals species that have changed little since the Jurassic era, and leads them to an encounter with one of the world’s rarest sharks.","time":"12:00 PM","title":"Alien Sharks"},{"desc":"Top 10 Sharkdown rewrites and updates theinternational shark attack files for the 21st century, to take a close look at the sharks you don&#39;t want to meet this summer -- and which ones you&#39;re likely to.","time":"1:00 PM","title":"Top Ten Sharkdown"},{"desc":"These are the harrowing first-hand tales, many caught on camera, of people who stared into the jaws of a shark and survived.","time":"2:00 PM","title":"I Escaped Jaws"},{"desc":"AIR JAWS is the never-ending search for the ultimate shark shot -- a look at the ultimate super-predator in action. Which is the greatest AIR JAWS shot of all time? And will this year&#39;s shot top the list?","time":"3:00 PM","title":"Air Jaws: Countdown to Shark Week 2013"},{"desc":"Get a MEGAdose of Megalodon in this special Sharktweeto episode with your live tweets, bonus scenes, and facts. Mythbusters and a team of specialists bring a giant prehistoric killer shark back to life after 2 million years as 52 ft mechanical Megalodon.","time":"4:00 PM","title":"Sharkzilla: Sharktweeto"},{"desc":"This special Sharktweeto episode has bite with your live tweets, bonus scenes, and facts. Jaws is back and ready to attack, maybe. Shark experts must track these Great White sharks to find out if they have returned to the waters of this popular beach.","time":"5:00 PM","title":"Return of Jaws: Sharktweeto"},{"desc":"This special Sharktweeto episode has bite with your live tweets, bonus scenes, and facts. These Swamp shark hunters try to track down the elusive &#34;Rookin&#34;. While researcher Jonathon Davis scours the waters of the Gulf of Mexico for this infamous shark.","time":"6:00 PM","title":"Voodoo Sharks: Sharktweeto"},{"desc":"","time":"7:00 PM","title":"Spawn of Jaws: Sharktweeto"},{"desc":"","time":"8:00 PM","title":"Sharkpocalypse: Sharktweeto"},{"desc":"","time":"9:00 PM","title":"Megalodon: Sharktweeto"},{"desc":"","time":"11:00 PM","title":"Sharkpocalypse: Sharktweeto"}],"Wednesday August 7":[{"desc":"These are the harrowing first-hand tales, many caught on camera, of people who stared into the jaws of a shark and survived.","time":"12:00 AM","title":"I Escaped Jaws"},{"desc":"Maverick scientist Michael Domeier launches a dangerous mission. Helped by Fast &#38; Furious star Paul Walker, he risks life and limb to unravel the mystery of where Jaws gives birth... by getting within arm&#39;s reach of the ocean&#39;s fiercest predator.","time":"1:00 AM","title":"Spawn of Jaws"},{"desc":"LIVE late night shark show! Celeb guest Mark Cuban, Tara Reid talks Sharknado, and more.","time":"2:00 AM","title":"Shark After Dark LIVE"},{"desc":"The waters off Mexico&#39;s western coastline host a diverse population of sharks whose survival is threatened by humans. Follow shark researcher Rocky Strong and naturalist Rocio Lozano as they swim with these creatures in four beautiful locations.","time":"9:00 AM","title":"Sharks in a Desert Sea"},{"desc":"Nine feet of brawn and muscle, the bull shark is one of the most aggressive animals on earth. Join zoologist Nigel Marven on a journey to learn more about these incredible predators, including a trip to the shark infested waters of the Bahamas.","time":"10:00 AM","title":"Bull Shark: World&#39;s Deadliest Shark"},{"desc":"Shark behavioral scientist Dr. Erich Ritter was bitten by a bull shark while filming with the Discovery Channel in the Bahamas. He will examine the footage of his unfortunate incident and discuss the difference between a shark bite and an actual attack.","time":"11:00 AM","title":"Anatomy of a Shark Bite"},{"desc":"Each year dozens of people are eaten alive by sharks. These are the world&#39;s five most amazing survivor stories.","time":"12:00 PM","title":"Top Five Eaten Alive"},{"desc":"LIVE late night shark show! Celeb guest Mark Cuban, Tara Reid talks Sharknado, and more.","time":"1:00 PM","title":"Shark After Dark LIVE"},{"desc":"This harrowing hour reveals the science behind what triggers sharks to attack at certain times of day, and what rules humans should follow to avoid incident.","time":"2:00 PM","title":"Day of the Shark"},{"desc":"What puts a shark into attack mode at certain times of the day? This harrowing hour uncovers the science behind shark attacks. Each story shows us how to avoid the Day of the Shark.","time":"3:00 PM","title":"Day of the Shark II"},{"desc":"Shark attack survivors recall six bloody tales of what happens when humans unwittingly find themselves face to face with the ocean&#39;s top predator.","time":"4:00 PM","title":"Day of the Shark 3"},{"desc":"Chief Shark Officer Andy Samberg takes us on a tour of a mysterious underwater world in the protected waters of the Bahamas, where it&#39;s shark-eat-shark, and shark-eat-pretty much everything else too. Join him as he explores the marvels of... Shark City!","time":"5:00 PM","title":"Shark City"},{"desc":"With the first shark attack in the state of Massachusetts for nearly 80 years, RETURN OF JAWS reveals brand new revelations about how the Great Whites live and hunt off Cape Cod by tracking a 17-ft shark with a robot submarine -- a Shark Week first.","time":"6:00 PM","title":"Return of Jaws"},{"desc":"These are the harrowing first-hand tales, many caught on camera, of people who stared into the jaws of a shark and survived.","time":"7:00 PM","title":"I Escaped Jaws"},{"desc":"This special Sharktweeto episode has bite with your live tweets, bonus scenes, and facts. These Swamp shark hunters try to track down the elusive &#34;Rookin&#34;. While researcher Jonathon Davis scours the waters of the Gulf of Mexico for this infamous shark.","time":"8:00 PM","title":"Voodoo Sharks: Sharktweeto"},{"desc":"Top 10 Sharkdown rewrites and updates theinternational shark attack files for the 21st century, to take a close look at the sharks you don&#39;t want to meet this summer -- and which ones you&#39;re likely to.","time":"9:00 PM","title":"Top Ten Sharkdown"},{"desc":"California’s Surf Beach may be haunted by a serial killing great white shark that returns every two years to kill. The key to solving this mystery is a CSI-style forensic study that analyzes bite patterns and uses DNA sampling of teeth left behind.","time":"10:00 PM","title":"Great White Serial Killer"},{"desc":"LIVE late night shark show! Fast N Loud&#39;s Richard and Aaron stop by to get sharky with surprise celeb guests!","time":"11:00 PM","title":"Shark After Dark LIVE"}],"Thursday August 8":[{"desc":"Top 10 Sharkdown rewrites and updates theinternational shark attack files for the 21st century, to take a close look at the sharks you don&#39;t want to meet this summer -- and which ones you&#39;re likely to.","time":"12:00 AM","title":"Top Ten Sharkdown"},{"desc":"California’s Surf Beach may be haunted by a serial killing great white shark that returns every two years to kill. The key to solving this mystery is a CSI-style forensic study that analyzes bite patterns and uses DNA sampling of teeth left behind.","time":"1:00 AM","title":"Great White Serial Killer"},{"desc":"LIVE late night shark show! Fast N Loud&#39;s Richard and Aaron stop by to get sharky with surprise celeb guests!","time":"2:00 AM","title":"Shark After Dark LIVE"},{"desc":"Journey to Palau and meet the people and their deep connection to sharks. Members of a local shark clan help shed light on why certain villages believe the sharks are gods. Have sharks and humans learned to accept each other over the centuries?","time":"9:00 AM","title":"Paradise for Predators: Sharks of Palau"},{"desc":"Enter the murky depths of the shark&#39;s secret world to witness startling new behaviors. Glimpse a habitat previously unknown to humans as remote control and satellite technology allow cameras to follow these deep-diving predators 24/7.","time":"10:00 AM","title":"Future Shark"},{"desc":"The Brazilian city of Recife is under siege. Its sharks have suddenly become man-eaters. Using the evidence left by the sharks&#39; jaws, a team of scientists use these clues to unravel the mystery of Recife&#39;s golden coastline.","time":"11:00 AM","title":"Shark Rebellion"},{"desc":"These are six of the most extreme shark attacks you’ll ever see on television. But what’s even more remarkable is that the survivors, permanently scarred by their attacks, have joined forces to rescue the awesome creatures that nearly killed them.","time":"12:00 PM","title":"Shark Fight"},{"desc":"LIVE late night shark show! Fast N Loud&#39;s Richard and Aaron stop by to get sharky with surprise celeb guests!","time":"1:00 PM","title":"Shark After Dark LIVE"},{"desc":"The existence of man eating &#39;rogue&#39; sharks has been hotly debated since the 1950s. This film unravels the truth behind the theory by analyzing some of the most notorious attacks from the last century and consulting the leading experts on shark biology.","time":"2:00 PM","title":"Rogue Sharks"},{"desc":"Discover the secret lives of great white sharks living off the coast of California. Shark scientists use the latest tagging technology to &#34;wire the Pacific&#34; and reveal astonishing facts about the great white.","time":"3:00 PM","title":"Great White Highway"},{"desc":"Go on a wild ride as we show you the LAST thing you&#39;d ever want to see in real life: close up views of attacks by the world&#39;s most deadly sharks -- from INSIDE their mouths!","time":"4:00 PM","title":"Into the Shark Bite"},{"desc":"It’s going to be a Killer Christmas! One of the most brutal, deadly, and unstoppable series of shark attacks terrorizes the coastal tourist towns of South Africa during the holiday season of 1957.","time":"5:00 PM","title":"Killer Sharks"},{"desc":"Top 10 Sharkdown rewrites and updates theinternational shark attack files for the 21st century, to take a close look at the sharks you don&#39;t want to meet this summer -- and which ones you&#39;re likely to.","time":"6:00 PM","title":"Top Ten Sharkdown"},{"desc":"California’s Surf Beach may be haunted by a serial killing great white shark that returns every two years to kill. The key to solving this mystery is a CSI-style forensic study that analyzes bite patterns and uses DNA sampling of teeth left behind.","time":"7:00 PM","title":"Great White Serial Killer"},{"desc":"","time":"8:00 PM","title":"Spawn of Jaws: Sharktweeto"},{"desc":"We follow a crazy duo travelling the globe, diving with sharks to test several theories showing how humans could be causing an increase in Shark Attacks. Could the continuing finning of sharks and destruction of our oceans create a &#34;Sharkpocalypse&#34;?","time":"9:00 PM","title":"Sharkpocalypse"},{"desc":"Scientists embark on an expedition to film bizarre, deadly and extremely rare sharks of the deep sea. Their search reveals species that have changed little since the Jurassic era, and leads them to an encounter with one of the world’s rarest sharks.","time":"10:00 PM","title":"Alien Sharks"},{"desc":"LIVE late night shark show! Josh gets Naked and we end the week with a bang!","time":"11:00 PM","title":"Shark After Dark LIVE"}],"Monday August 5":[{"desc":"In the summer of 2008, panic gripped the Pacific coast in the wake of 4 horrific shark attacks. Sharkbite Beach reveals the dramatic stories of survival and searches for clues that might explain why sharks turned on humans with such fury.","time":"4:00 PM","title":"Sharkbite Beach"},{"desc":"The existence of man eating &#39;rogue&#39; sharks has been hotly debated since the 1950s. This film unravels the truth behind the theory by analyzing some of the most notorious attacks from the last century and consulting the leading experts on shark biology.","time":"5:00 PM","title":"Rogue Sharks"},{"desc":"In April 2013, a fishing vessel was attacked off the coast of South Africa, killing all on board. A TV crew documented Marine Biologist Collin Drake as he worked to determine the predator responsible. His discovery is presented in this shocking footage.","time":"6:00 PM","title":"Megalodon: The Monster Shark Lives"},{"desc":"Get a MEGAdose of Megalodon in this special Sharktweeto episode with your live tweets, bonus scenes, and facts. Mythbusters and a team of specialists bring a giant prehistoric killer shark back to life after 2 million years as 52 ft mechanical Megalodon.","time":"8:00 PM","title":"Sharkzilla: Sharktweeto"},{"desc":"With the first shark attack in the state of Massachusetts for nearly 80 years, RETURN OF JAWS reveals brand new revelations about how the Great Whites live and hunt off Cape Cod by tracking a 17-ft shark with a robot submarine -- a Shark Week first.","time":"9:00 PM","title":"Return of Jaws"},{"desc":"There have been rumors of a monster shark living in bayous of Louisiana. A team of Cajun fishermen head out to prove its existence while a shark scientist attempts to research bull sharks living in a freshwater lake just outside of New Orleans.","time":"10:00 PM","title":"Voodoo Sharks"},{"desc":"LIVE late night shark show! Josh swims with sharks and is joined by Lord of the Rings star Dominic Monaghan.","time":"11:00 PM","title":"Shark After Dark LIVE"}],"Friday August 9":[{"desc":"We follow a crazy duo travelling the globe, diving with sharks to test several theories showing how humans could be causing an increase in Shark Attacks. Could the continuing finning of sharks and destruction of our oceans create a &#34;Sharkpocalypse&#34;?","time":"12:00 AM","title":"Sharkpocalypse"},{"desc":"Scientists embark on an expedition to film bizarre, deadly and extremely rare sharks of the deep sea. Their search reveals species that have changed little since the Jurassic era, and leads them to an encounter with one of the world’s rarest sharks.","time":"1:00 AM","title":"Alien Sharks"},{"desc":"LIVE late night shark show! Josh gets Naked and we end the week with a bang!","time":"2:00 AM","title":"Shark After Dark LIVE"},{"desc":"Rogue Nature&#39;s Dave Salmoni and shark scientist Ryan Johnson journey to the wild shores of New Guinea to try to unravel the mysterious secrets of the shark whisperers who call in sharks without bait and then catch them by hand.","time":"9:00 AM","title":"Shark Tribe"},{"desc":"In the last 330 years, there have been only 25 recorded shark attacks in Texas. But 18 of those have happened in the last 2 decades. And the summer of 2004 was shaping up to be one of the most dangerous years ever...","time":"10:00 AM","title":"Aaron Perez - Shark Attack Survivor"},{"desc":"A sudden, dramatic spike in shark attacks close beaches across Australia and scientists scramble for answers. On the water and in the laboratory, we follow investigators as they uncover a chain of events that caused the Australia’s Summer of the Shark.","time":"11:00 AM","title":"Summer of the Shark"},{"desc":"A shark&#39;s diet is the dominating factor in virtually every facet of its life. Are humans on the menu of the most feared sharks on earth? Experts and camera crews above and below the water will gauge shark reactions to various types of food.","time":"12:00 PM","title":"Shark Feeding Frenzy"},{"desc":"LIVE late night shark show! Josh gets Naked and we end the week with a bang!","time":"1:00 PM","title":"Shark After Dark LIVE"},{"desc":"Les Stroud puts himself in some of the most frightening scenarios imaginable to find out what, if anything, you can do when you cross paths with some of the deadliest species of sharks on the planet.","time":"2:00 PM","title":"Surviving Sharks"},{"desc":"SURVIVORMAN&#39;s Les Stroud is back for more shark action, this time venturing to five of the most notorious shark-infested waters in the world to find out which is the most dangerous.","time":"3:00 PM","title":"Deadly Waters"},{"desc":"Host Terry Schappert puts his Special Forces training to the test to demonstrate to viewers how to survive devastating shark attacks. Terry immerses himself in several deadly scenarios and reveals the secrets to escaping terrifying shark encounters alive.","time":"4:00 PM","title":"Shark Attack Survival Guide"},{"desc":"Great white sharks are now being routinely sighted off of some of the world&#39;s most popular beaches in California, Australia, and South Africa. Shark researchers hope to discover why these sharks are suddenly appearing and the potential threat to humans.","time":"5:00 PM","title":"Great White Invasion"},{"desc":"We follow a crazy duo travelling the globe, diving with sharks to test several theories showing how humans could be causing an increase in Shark Attacks. Could the continuing finning of sharks and destruction of our oceans create a &#34;Sharkpocalypse&#34;?","time":"6:00 PM","title":"Sharkpocalypse"},{"desc":"Scientists embark on an expedition to film bizarre, deadly and extremely rare sharks of the deep sea. Their search reveals species that have changed little since the Jurassic era, and leads them to an encounter with one of the world’s rarest sharks.","time":"7:00 PM","title":"Alien Sharks"},{"desc":"Divers risk it all in Australia’s treacherous shark-infested waters to capture a valuable sea creature -- a million dollar bounty, if they can survive the great white gauntlet.","time":"8:00 PM","title":"Great White Gauntlet"},{"desc":"The Hoffman crew flies to Chile in hopes of getting a slice of the country’s 3,750 tons of untapped gold reserves. They prospect on a remote beach and high in the Andes Mountains, pushing the crew to its limits.","time":"9:00 PM","title":"Gold Rush South America (Season 4)"},{"desc":"After having their rent raised by the Southie crew, the Rozzie crew must take a huge risk on a playoff hockey game. Tin Man finally lets his anger issues get the best of him and Pat Nee asks his crew to retrieve a very sensitive item.","time":"10:00 PM","title":"Saint Hoods"},{"desc":"The Hoffman crew flies to Chile in hopes of getting a slice of the country’s 3,750 tons of untapped gold reserves. They prospect on a remote beach and high in the Andes Mountains, pushing the crew to its limits.","time":"11:00 PM","title":"Gold Rush South America (Season 4)"}],"Sunday August 11":[{"desc":"","time":"12:00 AM","title":"Megalodon: Sharktweeto"},{"desc":"","time":"2:00 AM","title":"Spawn of Jaws: Sharktweeto"},{"desc":"There have been rumors of a monster shark living in bayous of Louisiana. A team of Cajun fishermen head out to prove its existence while a shark scientist attempts to research bull sharks living in a freshwater lake just outside of New Orleans.","time":"9:00 AM","title":"Voodoo Sharks"},{"desc":"In April 2013, a fishing vessel was attacked off the coast of South Africa, killing all on board. A TV crew documented Marine Biologist Collin Drake as he worked to determine the predator responsible. His discovery is presented in this shocking footage.","time":"10:00 AM","title":"Megalodon: The Monster Shark Lives"},{"desc":"An Austin, TX entrepreneur enlists Pete to build the world’s first spa treehouse on her ranch retreat. Pete tackles plumbing challenges and builds an over-the-top spa equipped with a steam shower, a Japanese soaking tub and plenty of tranquility.","time":"12:00 PM","title":"Treehouse Masters"},{"desc":"A writer in Rhinebeck, NY calls on Pete to build a hideaway to embrace her creativity. Pete transforms an old cedar tree into a gold-leafed &#34;Spirit House&#34; retreat filled with uplifting oddities and a loft to rest the brain if she hits a writer’s block.","time":"1:00 PM","title":"Treehouse Masters"},{"desc":"An adventurous couple wants to host their wedding at Treehouse Point, but all of the existing treehouses are booked! With some quick thinking, Pete convinces his family to make room for a new addition, and constructs a magical Honeymoon Suite.","time":"2:00 PM","title":"Treehouse Masters"},{"desc":"Faced with the need to expand their home after their daughter returns from college, a family in Medford, OR calls Pete to expand their not-so-empty-nest. Faced with evolving client requests, Pete transforms his design into a multi-faceted guesthouse.","time":"3:00 PM","title":"Treehouse Masters"},{"desc":"With a budget as high as the trees, a family in Bedford, NY hires Pete to design a dream clubhouse for the entire family. With a big BBQ patio, a living room and a lofted chalkboard covered playroom, Pete’s surprise treehouse brings fun for all ages.","time":"4:00 PM","title":"Treehouse Masters"},{"desc":"George and Scott are finally mining for the estimated $1.5M dollars of gold on their claim. But they must overcome floods, machinery meltdowns and armed Chinese neighbors if they have any hope of seeing their first jungle gold.","time":"5:00 PM","title":"Jungle Gold"},{"desc":"George is suddenly called home to fight a lawsuit, leaving Scott with the responsibility of doubling gold production on their claim. Chinese neighbors threaten their borders and the future of mechanic Travis lies in the balance.","time":"6:00 PM","title":"Jungle Gold"},{"desc":"Scott and George test out a brand new claim after racking up huge debts on the Romaso gold mine. They have to prove the new claim is stacked with gold or their investors will pull funding. George risks it all in an outrageous and dangerous gold hustle.","time":"7:00 PM","title":"Jungle Gold"},{"desc":"Scott and George’s African gold mining dream turns sour and drives them ever deeper into debt. They try to join forces with a gang of traditional miners to dig by hand and their relationship with mining partners Chris and Singh reaches meltdown.","time":"8:00 PM","title":"Jungle Gold"},{"desc":"","time":"9:00 PM","title":"Jungle Gold: Reclaimed"},{"desc":"$1 million in debt and determined to find gold, Scott and George head back to Ghana. They face armed guards, life threatening road accidents and violent confrontations in a desperate attempt to get their excavators back and save their mining deal.","time":"10:00 PM","title":"Jungle Gold"},{"desc":"","time":"11:00 PM","title":"Jungle Gold: Reclaimed"}]}